cases/Benchmarking/courantNumberStudy/courant_number_base/system/air/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U
{
    internalField   uniform (0 0 0);

    boundaryField
    {
        air
        {
            type            pressureInletOutletVelocity;
            value           $internalField;
        }
        bottom
        {
            type            noSlip;
        }
		symmetryPlanes
        {
			type            symmetry;
        }
        air_to_shippingBox
        {
            type            noSlip;
        }
    }
}

T
{
    internalField   uniform 300;

    boundaryField
    {
        air
        {
			type            inletOutlet;
			inletValue      uniform 300;
			value           uniform 300;
        }
        bottom
        {
            type            zeroGradient;
        }
		symmetryPlanes
        {
			type            symmetry;
        }
        air_to_shippingBox
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 300;
        }
    }
}

// epsilon
// {
//     internalField   uniform 0.01;

//     boundaryField
//     {
//         ".*"
//         {
//             type            epsilonWallFunction;
//             value           uniform 0.01;
//         }
//     }
// }

// k
// {
//     internalField   uniform 0.1;

//     boundaryField
//     {
//         ".*"
//         {
//             type            kqRWallFunction;
//             value           uniform 0.1;
//         }
//     }
// }

p_rgh
{
    internalField   uniform 1e5;

    boundaryField
    {
        bottom
        {
            type            fixedFluxPressure;
            value           $internalField;
        }
        air
        {
            type            totalPressure;
            p0              $internalField;
            value           $internalField;
        }
		symmetryPlanes
        {
			type            symmetry;
        }
        air_to_shippingBox
        {
            type    fixedFluxPressure;
            value   $internalField;
        }
    }
}

p
{
    internalField   uniform 1e5;

    boundaryField
    {
		symmetryPlanes
        {
			type            symmetry;
        }
        ".*"
        {
            type            calculated;
            value           $internalField;
        }
    }
}

// ************************************************************************* //
